---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.ProjectionMethod
source: html/35daa6b2-3b8a-9d69-4bd4-28e5339275d3.htm
---
# Autodesk.Revit.DB.DirectContext3D.ProjectionMethod

Projection method

## Syntax (C#)
```csharp
public enum ProjectionMethod
```